# coding=utf-8
from __future__ import unicode_literals
from .. import BaseProvider


# Ukrainian job names taken from
# https://uk.wikipedia.org/wiki/%D0%A1%D0%BF%D0%B8%D1%81%D0%BE%D0%BA_%D0%BF%D1%80%D0%BE%D1%84%D0%B5%D1%81%D1%96%D0%B9
# on 22th September 2014
# updates from http://www.osvita.com.ua/ua/professions/
class Provider(BaseProvider):
    jobs = [
        # А
        'Агроном', 'Адвокат', 'Актор', 'Акушер', 'Антрополог', 'Архітектор', 'Археолог', 'Астронавт', 'Астроном',
        'Астрофізик', 'Аналітик',
        # Б
        'Бібліограф', 'Біолог', 'Бізнесмен', 'Ботанік', 'Будник', 'Бухгалтер', 'Бібліотекар', 'Бізнес-аналітик',
        'Бренд-менеджер', 'Біофізик', 'Бармен', 'Брокер',
        # В
        'Ветеринар', 'Випробувач', 'Водій', 'Вчитель', 'Візажист', 'Веб-дизайнер', 'Веб-програміст', 'Вірусолог',
        # Г
        'Географ', 'Геолог' 'Геофізик' 'Гицель', 'Гінеколог', 'Гірник', 'Гірничий інженер', 'Головний меркшейдер',
        'Графік', 'Громадський діяч', 'Гід-перекладач',
        # Ґ
        'Ґрунтознавець',
        # Д
        'Державний службовець', 'Детектив', 'Дизайнер', 'Дипломат', 'Диригент', 'Доцент', 'Драматург',
        'Ді-джей', 'Дантист', 'Дієтолог', 'Дерматовенеролог', 'Диктор',
        # Е
        'Економіст', 'Електрик', 'Електромонтер', 'Електромонтажник', 'Електрослюсар', 'Електротехнік', 'Епідеміолог',
        'Етнограф', 'Еколог',
        # Є
        'Єгер',
        # Ж
        'Журналіст', 'Живописець',
        # З
        'Золотар', 'Зоолог', 'Зооінженер', 'Зварник',
        # І
        'Інженер', 'Історик', 'Іміджмейкер', 'Імунолог', 'Інфекціоніст', 'Інкасатор',
        # К
        'Каскадер', 'Кінорежисер', 'Клавішник', 'Клоун', 'Композитор', 'Конструктор', 'Краєзнавець', 'Кушнір',
        'Кіноактор', 'Кінокритик', 'Кінорежисер', 'Кур\'єр', 'Кухар', 'Кінолог', 'Круп\'є', 'Косметолог',
        'Кліпмейкер', 'Кардіолог', 'Кардіохірург', 'Кондуктор',
        # Л
        'Льотчик', 'Лікар', 'Літературознавець', 'Локсмайстер', 'Лінгвіст', 'Логопед', 'Логіст',
        # М
        'Математик', 'Машиніст', 'Медик', 'Менеджер', 'Мистецтвознавець', 'Мірошник', 'Мікробіолог', 'Мінералог',
        'Мовознавець', 'Модель', 'Модельєр', 'Музикант', 'Музикознавець', 'Музичний редактор', 'Маркетолог',
        'Мультиплікатор', 'Менеджер з PR', 'Мерчендайзер', 'Масажист',
        # Н
        'Намотувальник', 'Науковець', 'Няня', 'Нотаріус', 'Нейрохірург', 'Невролог', 'Нанотехнолог',
        # П
        'Палеонтолог', 'Паралегал', 'Парфюмер', 'Патологоанатом', 'Педагог', 'Пекар', 'Перекладач', 'Петрограф',
        'Письменник', 'Піаніст', 'Підприємець', 'Пілот', 'Правник', 'Програміст', 'Провізор', 'Прокурор',
        'Промисловець', 'Професор', 'Психолог', 'Публіцист', 'Продюсер', 'Перукар',
        # Р
        'Режисер', 'Різноробочий', 'Реабілітолог', 'Редактор', 'Реставратор', 'Ріелтор', 'Радіотехнік',
        # С
        'Сантехнік', 'Складальник', 'Скульптор', 'Соціолог', 'Співак', 'Сценарист', 'Стропальник', 'Стоматолог',
        'Слідчий', 'Стиліст', 'Секретар', 'Системний адміністратор', 'Супервайзер', 'Суддя', 'Сомельє',
        'Страховий агент',
        # Т
        'Тестувальник ПЗ', 'Ткач', 'Токар', 'Товарознавець', 'Трейдер', 'Тренер',
        # О
        'Офтальмолог', 'Охоронець', 'Оздоблювач', 'Офіціант', 'Офіс-менеджер', 'Оператор ПК',
        # Ф
        'Фармацевт', 'Фермер', 'Фізик', 'Філолог', 'Фольклорист', 'Фотограф', 'Фрілансер', 'Футболіст', 'Флорист',
        'Фінансовий аналітик', 'Фінансовий директор', 'Фінансовий менеджер',
        # Х
        'Хімік', 'Художник', 'Хореограф', 'Хед-хантер', 'Хірург', 'Художник-ілюстратор',
        # Ш
        'Шериф', 'Швачка', 'Штукатур',
        # Ю
        'Ювелір', 'Юрист'
    ]

    @classmethod
    def job(cls):
        return cls.random_element(cls.jobs)
